app/Views/modules/settings/settings.php

SELECT *
FROM `hd_hooks`
WHERE `hook` = 'settings_menu_admin'
AND `visible` = 1
ORDER BY `order` ASC
---
                        <ul class="list-group" id="settings_menu">
                            <?php

                        $query = $db->table('hd_hooks')
                            ->where('hook', 'settings_menu_admin')
                            ->where('visible', 1)
                            ->orderBy('order', 'ASC')
                            ->get();