app/Modules/Dashboard/Controllers/DashboardController.php

SELECT *
FROM `hd_invoices`
---
    function _totals() {
        $session = \Config\Services::session();

        // Modify the 'default' property


        // Connect to the database
        $db = \Config\Database::connect();

        $invoiceModel = new \App\Models\Invoice($db);

        $paid = $due = array();
        //$currency = config_item('default_currency');
        $currency = 'USD';
        $symbol = array();
        $paid = $due = 0;
        foreach($invoiceModel->get() as $inv) {

SELECT *
FROM `hd_invoices`
---
    function _totals_per_currency() {

        $session = \Config\Services::session();

        // Modify the 'default' property

        // Connect to the database
        $db = \Config\Database::connect();

        $invoiceModel = new \App\Models\Invoice($db);

        $paid = $due = array();
        foreach($invoiceModel->get() as $inv) {