app/Views/modules/clients/client_area.php

SELECT *
FROM `hd_tickets`
WHERE `reporter` = '10'
---
                                // Connect to the database
                                $db = \Config\Database::connect();

                                $tickets = $db->table('hd_tickets')->where('reporter', $user)->get()->getResult();