app/Views/modules/sidebar/top_header.php

						if ($user_data['role_id'] == 1 || $user_data['role_id'] == 3) {
							//$menus = $this->db->where('access', 1)->where('visible', 1)->where('parent', '')->where('hook', 'main_menu_admin')->order_by('order', 'ASC')->get('hooks')->result();

							$menus = $db->table('hd_hooks')
								->where('access', 1)
								->where('visible', 1)
								->where('parent', '')
								->where('hook', 'main_menu_admin')
								->orderBy('order', 'ASC')
								->get()
								->getResult();
---
SELECT *
FROM `hd_hooks`
WHERE `access` = 1
AND `visible` = 1
AND `parent` = 'menu_dashboard'
AND `hook` = 'main_menu_admin'
ORDER BY `order` ASC