app/Views/modules/sidebar/user_menu.php

					// $menus = $this->db->where('access', 2)->where('visible', 1)->where('parent', '')->where('hook', 'main_menu_client')->order_by('order', 'ASC')->get('hooks')->result();

					$builder = $db->table('hd_hooks');
					$menus = $builder
						->where('access', 2)
						->where('visible', 1)
						->where('parent', '')
						->where('hook', 'main_menu_client')
						->orderBy('order', 'ASC')
						->get()
						->getResult();
---
SELECT *
FROM `hd_hooks`
WHERE `access` = 2
AND `visible` = 1
AND `parent` = ''
AND `hook` = 'main_menu_client'
ORDER BY `order` ASC

						// $sub = $this->db->where('access', 2)->where('visible', 1)->where('parent', $menu->module)->where('hook', 'main_menu_client')->order_by('order', 'ASC')->get('hooks');

						$builder = $db->table('hd_hooks');
						$sub = $builder
							->where('access', 2)
							->where('visible', 1)
							->where('parent', $menu->module)
							->where('hook', 'main_menu_client')
							->orderBy('order', 'ASC')
							->get();
---
SELECT *
FROM `hd_hooks`
WHERE `access` = 2
AND `visible` = 1
AND `parent` = 'menu_home'
AND `hook` = 'main_menu_client'
ORDER BY `order` ASC