app/Helpers/custom_name_helper.php

SELECT `value`
FROM `hd_config`
WHERE `config_key` = 'company_name'
---
    function getconfig_item($configKey) {
        $session = \Config\Services::session();
        // Connect to the database
        $db = \Config\Database::connect();

        $query = $db->table('hd_config')
            ->select('value')
            ->where('config_key', $configKey)
            ->get();