app/Models/Addon.php

SELECT `hd_items_saved`.*, `hd_item_pricing`.*
FROM `hd_items_saved`
INNER JOIN `hd_item_pricing` ON `hd_items_saved`.`item_id` = `hd_item_pricing`.`item_id`
WHERE `hd_items_saved`.`addon` = 1
---
    public function all($array, $search, $perPage, $page)
    {
        $session = \Config\Services::session();

        // Connect to the database
        $db = \Config\Database::connect();

        $this->select('hd_items_saved.*, hd_item_pricing.*')
            ->join('hd_item_pricing', 'hd_items_saved.item_id = hd_item_pricing.item_id', 'INNER')
            ->where('hd_items_saved.addon', 1);

        // If there's a search term, apply it across relevant fields
        if (!empty($search)) {
            $this->groupStart()
                ->like('hd_items_saved.item_name', $search)
                ->groupEnd();
        }

        // Utilize the model's built-in pagination
        $data = $this->paginate($perPage);