app/Models/App.php

SELECT *
FROM `hd_countries`
---
    public static function countries()
    {
        // return self::$db->table('countries')->get()->getResult();

        $session = \Config\Services::session();



        // Modify the 'default' property

        // Connect to the database
        $dbName = \Config\Database::connect();

        $db = db_connect($dbName);

        return $db->table('hd_countries')->get()->getResult();

SELECT *
FROM `hd_currencies`
WHERE `code` = 'INR'
---
    public static function currencies($code = null)
    {
        $session = \Config\Services::session();



        // Modify the 'default' property

        // Connect to the database
        $dbName = \Config\Database::connect();

        $db = \Config\Database::connect($dbName); // Get the default database connection

        $builder = $db->table('hd_currencies');

        if (!$code) {
            return $builder->orderBy('name', 'ASC')->get()->getResult();
        }

        $c = $builder->where('code', $code)->get()->getResult();

SELECT *
FROM `hd_languages`
ORDER BY `name` ASC
---
    public static function languages($lang = null)
    {
        $session = \Config\Services::session();

        $db = \Config\Database::connect(); // Get the default database connection

        $custom = new custom_name_helper();

        $builder = $db->table('hd_languages');

        if (!$lang) {
            return $builder->orderBy('name', 'ASC')->get()->getResult();

SELECT *
FROM `hd_hooks`
WHERE `module` = 'menu_orders'
AND `hook` = 'main_menu_admin'
---
    public function module_access($module)
    {
        $session = \Config\Services::session();

        // Connect to the database
        $dbName = \Config\Database::connect();

        // $model = new self($dbName);
        // echo 3;die;
        // echo User::get_role(User::get_id());die;

        $result = $dbName->table('hd_hooks')->where([
            'module' => $module,
            'hook' => 'main_menu_' . User::get_role(User::get_id()),
        ])->get()->getRow();

SELECT *
FROM `hd_locales`
WHERE `locale` = 'en_US'
---
    public static function get_locale()
    {

        $session = \Config\Services::session();





        // Modify the 'default' property


        $db = \Config\Database::connect(); // Connect to the database

        $config = new MyConfig();

        $result = $db->table('hd_locales')
            ->where('locale', $config->locale)
            ->get()
            ->getRow();