app/Models/Client.php

SELECT *
FROM `hd_companies`
WHERE `co_id` > 1
ORDER BY `company_name` ASC
---
	public static function get_all_clients()
	{
		// return self::$db->where(array('co_id >' => 1))->order_by('company_name', 'ASC')->get('companies')->result();

		$session = \Config\Services::session();

        // Connect to the database
        $db = \Config\Database::connect();

		/* return $db->table('hd_companies')
			->distinct('company_name')
			->where('co_id >', 1)
			->orderBy('company_name', 'ASC')
			->get()
			->getResult();

SELECT *
FROM `hd_payments`
WHERE `paid_by` = '7'
AND `refunded` = 'No'
---
	public static function amount_paid($company)
	{
		$session = \Config\Services::session();


		$custom_helper = new custom_name_helper();


        // Modify the 'default' property


        // Connect to the database
        $db = \Config\Database::connect();

		$total = 0;
		if ($company > 0) {
			$payments = $db->table('hd_payments')->where(array('paid_by' => $company, 'refunded' => 'No'))->get()->getResult();