app/Models/Invoice.php

SELECT *
FROM `hd_invoices`
WHERE `inv_id` = '7'
---
	public function listItems($array, $search, $perPage, $page)
    {
        $db = \Config\Database::connect();
        // Begin the selection process using the model's query builder directly
        $this->select('hd_invoices.*, hd_companies.*')->join('hd_companies', 'hd_companies.co_id = hd_invoices.client')->where($array);

        // If there's a search term, apply it across relevant fields
        if (!empty($search)) {
            $this->groupStart()
                ->like('hd_invoices.reference_no', $search)
                ->orLike('hd_invoices.tax', $search)
                ->orLike('hd_invoices.currency', $search)
                ->orLike('hd_invoices.status', $search)
				->orLike('hd_companies.company_name', $search)
                ->groupEnd();
        }

        // Utilize the model's built-in pagination
        $data = $this->paginate($perPage);