app/Models/Item.php

SELECT `item_name`, `registration`, `renewal`, `transfer`
FROM `hd_items_saved`
INNER JOIN `hd_item_pricing` ON `hd_items_saved`.`item_id` = `hd_item_pricing`.`item_id`
LEFT JOIN `hd_categories` ON `hd_categories`.`id` = `hd_item_pricing`.`category`
WHERE `deleted` = 'No'
AND `active` = 'Yes'
AND `display` = 'Yes'
AND `hd_categories`.`parent` = 8
ORDER BY `hd_items_saved`.`order_by` ASC
---
    public static function get_domains($id = null)
    {	//echo 90;die;
        $session = \Config\Services::session();

        $db = \Config\Database::connect();

        $builder = $db->table('hd_items_saved');
        $builder->select('item_name, registration, renewal, transfer');
        $builder->join('hd_item_pricing', 'hd_items_saved.item_id = hd_item_pricing.item_id', 'INNER');
        $builder->join('hd_categories', 'hd_categories.id = hd_item_pricing.category', 'LEFT');
        $builder->where('hd_items_saved.deleted', 'No');
        $builder->where('hd_items_saved.active', 'Yes');
        $builder->where('hd_items_saved.display', 'Yes');
        if ($id) {
            $builder->where('hd_categories.id', $id);
        }
        $builder->where('hd_categories.parent', 8);
        $builder->orderBy('hd_items_saved.order_by', 'ASC');
		//print_r($db->getLastQuery());die;
        $query = $builder->get();

SELECT `hd_items_saved`.*, `hd_item_pricing`.*, `hd_categories`.*
FROM `hd_items_saved`
LEFT JOIN `hd_item_pricing` ON `hd_items_saved`.`item_id` = `hd_item_pricing`.`item_id`
LEFT JOIN `hd_categories` ON `hd_categories`.`id` = `hd_item_pricing`.`category`
WHERE `hd_items_saved`.`item_name` = '.in'
---
	static function view_item_domain_tlds($tlds)
	{
		$tlds = '.' . $tlds;

		$db = \Config\Database::connect();

		$query = $db->table('hd_items_saved')
				->select('hd_items_saved.*, hd_item_pricing.*, hd_categories.*')
				->join('hd_item_pricing','hd_items_saved.item_id = hd_item_pricing.item_id','LEFT')
                ->join('hd_categories','hd_categories.id = hd_item_pricing.category','LEFT')
				->where('hd_items_saved.item_name', $tlds)->get()->getRow();