app/Models/Order.php

SELECT `id`
FROM `hd_orders`
WHERE `client_id` = '7'
AND `o_id` = 0
AND (`type` = 'hosting')
---
    static function client_accounts($client)
    {
        $session = \Config\Services::session();

        // Connect to the database
        $db = Database::connect();

        $query = $db->table('hd_orders')
            ->select('id')
            ->where('client_id', $client)
            ->where('o_id', 0)
            ->where("(type ='hosting')")
            ->get();