app/Models/Payment.php

SELECT *
FROM `hd_payments`
WHERE `inv_deleted` = 'No'
ORDER BY `created_date` DESC
---
    static function recent_paid()
	{
        $session = \Config\Services::session();
        // Connect to the database
        $db = \Config\Database::connect();

        $model = new self($db); // Create an instance of the current model

		return $model->orderBy('created_date', 'desc')
            ->where('inv_deleted', 'No')
            ->limit(15)
            ->findAll();