app/Models/Plugin.php

    public static function payment_gateways()
    {
        $db = \Config\Database::connect();

        return $db->table('hd_plugins') // Replace 'your_table_name' with the actual table name
            ->where('category', 'Payment Gateways')
            ->where('status', 1)
            ->get()
            ->getResult();
---
SELECT *
FROM `hd_plugins`
WHERE `category` = 'Domain Registrars'
AND `status` = 1