app/Libraries/AppLib.php

    static function convert_currency($currency, $amount)
    {
        $session = \Config\Services::session();




        // Modify the 'default' property

        // Connect to the database
        $db = \Config\Database::connect();

        $custom_name_helper = new custom_name_helper();

        if (empty($currency)) {
            return $amount;
        }

        if ($currency == $custom_name_helper->getconfig_item('default_currency')) {
            return $amount;
        }

        $c = $db->table('hd_currencies')->where('code', $custom_name_helper->getconfig_item('default_currency'))->get()->getResult();
---
SELECT *
FROM `hd_currencies`
WHERE `code` = 'INR'